Revit 2027 API
ScheduleDefinition.GetFilterCount Method
 Gets the number of filters in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetFilterCount()
Public Function GetFilterCount As Integer
public:
int GetFilterCount()
member GetFilterCount : unit -> int
Return Value
Int32
 The number of filters.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace